# 1. Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли 
# этот день выходным.

day = int(input('Введите цифру дня недели: '))
if day == 1:
    print('Нет')
elif day == 2:
    print('Нет')
elif day == 3:
    print('Нет')
elif day == 4:
    print('Нет')
elif day == 5:
    print('Нет')
elif day == 6:
    print('Да')
else:
    print('Да')

# 3. Напишите программу, которая принимает на вход координаты точки (X и Y), причём X ≠ 0 и Y ≠ 0 и 
# выдаёт номер четверти плоскости, в которой находится эта точка (или на какой оси она находится).

