/*
int NaturlSum(int a);
{
    int sum = 0;

    if(a < 1) return 0;
    else
}
*/

// Задача 2. Напишите программу, которая принимает на вход число и выдаёт количество цифр в числе.

int NumberOfDigits(int n)
{
    int i = 0; i != 0; i++)
        {
            n = n/10;
        }
        return i;
}


// Задача 3. Напишите программу, которая принимает на вход число N и выдаёт произведение чисел от 1 до N.

// Задача 4. Напишите программу, которая выводит массив из 8 элементов, заполненный нулями и единицами в случайном порядке.
// [1,0,1,1,0,1,0,0]

// Задача 5. Задайте массив из 12 элементов, заполненный случайными числами из промежутка [-9, 9]. Найдите сумму отрицательных и положительных элементов массива.


